; ModuleID = '<stdin>'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GumboInternalOptions = type { i8* (i8*, i64)*, void (i8*, i8*)*, i8*, i32, i8, i32, i32, i32 }
%struct.GumboInternalOutput = type { %struct.GumboInternalNode*, %struct.GumboInternalNode*, %struct.GumboVector }
%struct.GumboInternalNode = type { i32, %struct.GumboInternalNode*, i64, i32, %union.anon }
%union.anon = type { %struct.GumboElement }
%struct.GumboElement = type { %struct.GumboVector, i32, i32, %struct.GumboStringPiece, %struct.GumboStringPiece, %struct.GumboSourcePosition, %struct.GumboSourcePosition, %struct.GumboVector }
%struct.GumboStringPiece = type { i8*, i64 }
%struct.GumboSourcePosition = type { i32, i32, i32 }
%struct.GumboVector = type { i8**, i32, i32 }
%struct.GumboText = type { i8*, %struct.GumboStringPiece, %struct.GumboSourcePosition }

@.str = private unnamed_addr constant [6 x i8] c"input\00", align 1
@kGumboDefaultOptions = external dso_local constant %struct.GumboInternalOptions, align 8
@.str.1 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.2 = private unnamed_addr constant [33 x i8] c"root->type == GUMBO_NODE_ELEMENT\00", align 1
@.str.3 = private unnamed_addr constant [24 x i8] c"../examples/get_title.c\00", align 1

!165 = !DIEnumerator(name: "GUMBO_TAG_ISINDEX", value: 131)
!166 = !DIEnumerator(name: "GUMBO_TAG_LISTING", value: 132)
!167 = !DIEnumerator(name: "GUMBO_TAG_XMP", value: 133)
!168 = !DIEnumerator(name: "GUMBO_TAG_NEXTID", value: 134)
!169 = !DIEnumerator(name: "GUMBO_TAG_NOEMBED", value: 135)
!170 = !DIEnumerator(name: "GUMBO_TAG_PLAINTEXT", value: 136)
!171 = !DIEnumerator(name: "GUMBO_TAG_RB", value: 137)
!172 = !DIEnumerator(name: "GUMBO_TAG_STRIKE", value: 138)
!173 = !DIEnumerator(name: "GUMBO_TAG_BASEFONT", value: 139)
!174 = !DIEnumerator(name: "GUMBO_TAG_BIG", value: 140)
!175 = !DIEnumerator(name: "GUMBO_TAG_BLINK", value: 141)
!176 = !DIEnumerator(name: "GUMBO_TAG_CENTER", value: 142)
!177 = !DIEnumerator(name: "GUMBO_TAG_FONT", value: 143)
!178 = !DIEnumerator(name: "GUMBO_TAG_MARQUEE", value: 144)
!179 = !DIEnumerator(name: "GUMBO_TAG_MULTICOL", value: 145)
!180 = !DIEnumerator(name: "GUMBO_TAG_NOBR", value: 146)
!181 = !DIEnumerator(name: "GUMBO_TAG_SPACER", value: 147)
!182 = !DIEnumerator(name: "GUMBO_TAG_TT", value: 148)
!183 = !DIEnumerator(name: "GUMBO_TAG_RTC", value: 149)
!184 = !DIEnumerator(name: "GUMBO_TAG_UNKNOWN", value: 150)
!185 = !DIEnumerator(name: "GUMBO_TAG_LAST", value: 151)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 334, baseType: !5, size: 32, elements: !187)
!187 = !{!188, !189, !190}
!188 = !DIEnumerator(name: "GUMBO_NAMESPACE_HTML", value: 0)
!189 = !DIEnumerator(name: "GUMBO_NAMESPACE_SVG", value: 1)
!190 = !DIEnumerator(name: "GUMBO_NAMESPACE_MATHML", value: 2)
!191 = !{!192, !194}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!195 = !{!"clang version 14.0.0 (git@github.com:charitha22/llvm-project-rocm.git e58f918745aeb5db2256d6110be8dd5255e5f113)"}
!196 = !{i32 7, !"Dwarf Version", i32 4}
!197 = !{i32 2, !"Debug Info Version", i32 3}
!198 = !{i32 1, !"wchar_size", i32 4}
!199 = !{i32 7, !"uwtable", i32 1}
!200 = distinct !DISubprogram(name: "klee_make_symbolic", scope: !1, file: !1, line: 26, type: !201, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !208)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !194, !203, !206}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !204, line: 46, baseType: !205)
!204 = !DIFile(filename: "llvm-project-rocm/build_cfmse/lib/clang/14.0.0/include/stddef.h", directory: "/home/min/a/cgusthin/git")
!205 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!208 = !{!209, !210, !211}
!209 = !DILocalVariable(arg: 1, scope: !200, file: !1, line: 26, type: !194)
!210 = !DILocalVariable(arg: 2, scope: !200, file: !1, line: 26, type: !203)
!211 = !DILocalVariable(arg: 3, scope: !200, file: !1, line: 26, type: !206)
!212 = !{!213, !213, i64 0}
!213 = !{!"any pointer", !214, i64 0}
!214 = !{!"omnipotent char", !215, i64 0}
!215 = !{!"Simple C/C++ TBAA"}
!216 = !DILocation(line: 26, column: 31, scope: !200)
!217 = !{!218, !218, i64 0}
!218 = !{!"long", !214, i64 0}
!219 = !DILocation(line: 26, column: 39, scope: !200)
!220 = !DILocation(line: 26, column: 53, scope: !200)
!221 = !DILocation(line: 26, column: 56, scope: !200)
!222 = distinct !DISubprogram(name: "klee_assume", scope: !1, file: !1, line: 27, type: !223, scopeLine: 27, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !226)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !225}
!225 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!226 = !{!227}
!227 = !DILocalVariable(name: "uintptr_t", arg: 1, scope: !222, file: !1, line: 27, type: !225)
!228 = !{!229, !229, i64 0}
!229 = !{!"int", !214, i64 0}
!230 = !DILocation(line: 27, column: 18, scope: !222)
!231 = !DILocation(line: 27, column: 30, scope: !222)
!232 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 75, type: !233, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !236)
!233 = !DISubroutineType(types: !234)
!234 = !{!225, !225, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!236 = !{!237, !238, !239, !240, !241, !313}
!237 = !DILocalVariable(name: "argc", arg: 1, scope: !232, file: !1, line: 75, type: !225)
!238 = !DILocalVariable(name: "argv", arg: 2, scope: !232, file: !1, line: 75, type: !235)
!239 = !DILocalVariable(name: "input", scope: !232, file: !1, line: 88, type: !192)
!240 = !DILocalVariable(name: "input_length", scope: !232, file: !1, line: 92, type: !225)
!241 = !DILocalVariable(name: "output", scope: !232, file: !1, line: 94, type: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboOutput", file: !4, line: 646, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GumboInternalOutput", file: !4, line: 625, size: 256, elements: !245)
!245 = !{!246, !311, !312}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "document", scope: !244, file: !4, line: 630, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboNode", file: !4, line: 316, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GumboInternalNode", file: !4, line: 517, size: 1024, elements: !250)
!250 = !{!251, !253, !254, !255, !257}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !249, file: !4, line: 519, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboNodeType", file: !4, line: 310, baseType: !3)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !249, file: !4, line: 522, baseType: !247, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "index_within_parent", scope: !249, file: !4, line: 525, baseType: !203, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !249, file: !4, line: 532, baseType: !256, size: 32, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboParseFlags", file: !4, line: 416, baseType: !14)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !249, file: !4, line: 539, baseType: !258, size: 768, offset: 256)
!258 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !4, line: 535, size: 768, elements: !259)
!259 = !{!260, !279, !304}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "document", scope: !258, file: !4, line: 536, baseType: !261, size: 448)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboDocument", file: !4, line: 442, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 421, size: 448, elements: !263)
!263 = !{!264, !272, !274, !275, !276, !277}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !262, file: !4, line: 427, baseType: !265, size: 128)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboVector", file: !4, line: 133, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 122, size: 128, elements: !267)
!267 = !{!268, !270, !271}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !4, line: 126, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !266, file: !4, line: 129, baseType: !5, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !266, file: !4, line: 132, baseType: !5, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "has_doctype", scope: !262, file: !4, line: 430, baseType: !273, size: 8, offset: 128)
!273 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !4, line: 433, baseType: !206, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "public_identifier", scope: !262, file: !4, line: 434, baseType: !206, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "system_identifier", scope: !262, file: !4, line: 435, baseType: !206, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "doc_type_quirks_mode", scope: !262, file: !4, line: 441, baseType: !278, size: 32, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboQuirksModeEnum", file: !4, line: 325, baseType: !27)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !258, file: !4, line: 537, baseType: !280, size: 768)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboElement", file: !4, line: 511, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 472, size: 768, elements: !282)
!282 = !{!283, !284, !286, !288, !294, !295, !302, !303}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !281, file: !4, line: 477, baseType: !265, size: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !281, file: !4, line: 480, baseType: !285, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboTag", file: !4, line: 165, baseType: !32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tag_namespace", scope: !281, file: !4, line: 483, baseType: !287, size: 32, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboNamespaceEnum", file: !4, line: 338, baseType: !186)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "original_tag", scope: !281, file: !4, line: 491, baseType: !289, size: 128, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboStringPiece", file: !4, line: 94, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 88, size: 128, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !290, file: !4, line: 90, baseType: !206, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !290, file: !4, line: 93, baseType: !203, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "original_end_tag", scope: !281, file: !4, line: 498, baseType: !289, size: 128, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "start_pos", scope: !281, file: !4, line: 501, baseType: !296, size: 96, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboSourcePosition", file: !4, line: 71, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 67, size: 96, elements: !298)
!298 = !{!299, !300, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !297, file: !4, line: 68, baseType: !5, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !297, file: !4, line: 69, baseType: !5, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !297, file: !4, line: 70, baseType: !5, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "end_pos", scope: !281, file: !4, line: 504, baseType: !296, size: 96, offset: 544)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !281, file: !4, line: 510, baseType: !265, size: 128, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !258, file: !4, line: 538, baseType: !305, size: 320)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboText", file: !4, line: 466, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 448, size: 320, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !306, file: !4, line: 453, baseType: !206, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "original_text", scope: !306, file: !4, line: 459, baseType: !289, size: 128, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "start_pos", scope: !306, file: !4, line: 465, baseType: !296, size: 96, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !244, file: !4, line: 636, baseType: !247, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !244, file: !4, line: 645, baseType: !265, size: 128, offset: 128)
!313 = !DILocalVariable(name: "title", scope: !232, file: !1, line: 96, type: !206)
!314 = !DILocation(line: 75, column: 14, scope: !232)
!315 = !DILocation(line: 75, column: 33, scope: !232)
!316 = !DILocation(line: 88, column: 3, scope: !232)
!317 = !DILocation(line: 88, column: 9, scope: !232)
!318 = !DILocation(line: 88, column: 26, scope: !232)
!319 = !DILocation(line: 90, column: 22, scope: !232)
!320 = !DILocation(line: 90, column: 3, scope: !232)
!321 = !DILocation(line: 91, column: 15, scope: !232)
!322 = !{!214, !214, i64 0}
!323 = !DILocation(line: 91, column: 34, scope: !232)
!324 = !DILocation(line: 91, column: 3, scope: !232)
!325 = !DILocation(line: 92, column: 3, scope: !232)
!326 = !DILocation(line: 92, column: 7, scope: !232)
!327 = !DILocation(line: 94, column: 3, scope: !232)
!328 = !DILocation(line: 94, column: 16, scope: !232)
!329 = !DILocation(line: 95, column: 30, scope: !232)
!330 = !DILocation(line: 95, column: 37, scope: !232)
!331 = !DILocation(line: 94, column: 25, scope: !232)
!332 = !DILocation(line: 96, column: 3, scope: !232)
!333 = !DILocation(line: 96, column: 15, scope: !232)
!334 = !DILocation(line: 96, column: 34, scope: !232)
!335 = !DILocation(line: 96, column: 42, scope: !232)
!336 = !{!337, !213, i64 8}
!337 = !{!"GumboInternalOutput", !213, i64 0, !213, i64 8, !338, i64 16}
!338 = !{!"", !213, i64 0, !229, i64 8, !229, i64 12}
!339 = !DILocation(line: 96, column: 23, scope: !232)
!340 = !DILocation(line: 97, column: 18, scope: !232)
!341 = !DILocation(line: 97, column: 3, scope: !232)
!342 = !DILocation(line: 98, column: 47, scope: !232)
!343 = !DILocation(line: 98, column: 3, scope: !232)
!344 = !DILocation(line: 99, column: 8, scope: !232)
!345 = !DILocation(line: 99, column: 3, scope: !232)
!346 = !DILocation(line: 100, column: 1, scope: !232)
!347 = !DISubprogram(name: "gumbo_parse_with_options", scope: !4, file: !4, line: 661, type: !348, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !371)
!348 = !DISubroutineType(types: !349)
!349 = !{!350, !351, !206, !205}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GumboInternalOptions", file: !4, line: 563, size: 384, elements: !354)
!354 = !{!355, !360, !365, !366, !367, !368, !369, !370}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !353, file: !4, line: 565, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboAllocatorFunction", file: !4, line: 549, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!194, !194, !203}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "deallocator", scope: !353, file: !4, line: 568, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "GumboDeallocatorFunction", file: !4, line: 555, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !194, !194}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !353, file: !4, line: 574, baseType: !194, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tab_stop", scope: !353, file: !4, line: 580, baseType: !225, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "stop_on_first_error", scope: !353, file: !4, line: 586, baseType: !273, size: 8, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "max_errors", scope: !353, file: !4, line: 595, baseType: !225, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_context", scope: !353, file: !4, line: 610, baseType: !285, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_namespace", scope: !353, file: !4, line: 618, baseType: !287, size: 32, offset: 320)
!371 = !{}
!372 = distinct !DISubprogram(name: "find_title", scope: !1, file: !1, line: 42, type: !373, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !377)
!373 = !DISubroutineType(types: !374)
!374 = !{!206, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!377 = !{!378, !379, !382, !383, !385, !388, !390, !392, !395}
!378 = !DILocalVariable(name: "root", arg: 1, scope: !372, file: !1, line: 42, type: !375)
!379 = !DILocalVariable(name: "root_children", scope: !372, file: !1, line: 46, type: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!382 = !DILocalVariable(name: "head", scope: !372, file: !1, line: 47, type: !247)
!383 = !DILocalVariable(name: "i", scope: !384, file: !1, line: 48, type: !225)
!384 = distinct !DILexicalBlock(scope: !372, file: !1, line: 48, column: 3)
!385 = !DILocalVariable(name: "child", scope: !386, file: !1, line: 49, type: !247)
!386 = distinct !DILexicalBlock(scope: !387, file: !1, line: 48, column: 51)
!387 = distinct !DILexicalBlock(scope: !384, file: !1, line: 48, column: 3)
!388 = !DILocalVariable(name: "head_children", scope: !372, file: !1, line: 58, type: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!390 = !DILocalVariable(name: "i", scope: !391, file: !1, line: 59, type: !225)
!391 = distinct !DILexicalBlock(scope: !372, file: !1, line: 59, column: 3)
!392 = !DILocalVariable(name: "child", scope: !393, file: !1, line: 60, type: !247)
!393 = distinct !DILexicalBlock(scope: !394, file: !1, line: 59, column: 51)
!394 = distinct !DILexicalBlock(scope: !391, file: !1, line: 59, column: 3)
!395 = !DILocalVariable(name: "title_text", scope: !396, file: !1, line: 66, type: !247)
!396 = distinct !DILexicalBlock(scope: !397, file: !1, line: 62, column: 50)
!397 = distinct !DILexicalBlock(scope: !393, file: !1, line: 61, column: 9)
!398 = !DILocation(line: 42, column: 48, scope: !372)
!399 = !DILocation(line: 43, column: 3, scope: !400)
!400 = distinct !DILexicalBlock(scope: !401, file: !1, line: 43, column: 3)
!401 = distinct !DILexicalBlock(scope: !372, file: !1, line: 43, column: 3)
!402 = !{!403, !214, i64 0}
!403 = !{!"GumboInternalNode", !214, i64 0, !213, i64 8, !218, i64 16, !214, i64 24, !214, i64 32}
!404 = !DILocation(line: 43, column: 3, scope: !401)
!405 = !DILocation(line: 44, column: 3, scope: !406)
!406 = distinct !DILexicalBlock(scope: !407, file: !1, line: 44, column: 3)
!407 = distinct !DILexicalBlock(scope: !372, file: !1, line: 44, column: 3)
!408 = !DILocation(line: 44, column: 3, scope: !407)
!409 = !DILocation(line: 46, column: 3, scope: !372)
!410 = !DILocation(line: 46, column: 22, scope: !372)
!411 = !DILocation(line: 46, column: 39, scope: !372)
!412 = !DILocation(line: 46, column: 45, scope: !372)
!413 = !DILocation(line: 46, column: 47, scope: !372)
!414 = !DILocation(line: 46, column: 55, scope: !372)
!415 = !DILocation(line: 47, column: 3, scope: !372)
!416 = !DILocation(line: 47, column: 14, scope: !372)
!417 = !DILocation(line: 48, column: 8, scope: !384)
!418 = !DILocation(line: 48, column: 12, scope: !384)
!419 = !DILocation(line: 48, column: 19, scope: !387)
!420 = !DILocation(line: 48, column: 23, scope: !387)
!421 = !DILocation(line: 48, column: 38, scope: !387)
!422 = !{!338, !229, i64 8}
!423 = !DILocation(line: 48, column: 21, scope: !387)
!424 = !DILocation(line: 48, column: 3, scope: !384)
!425 = !DILocation(line: 49, column: 5, scope: !386)
!426 = !DILocation(line: 49, column: 16, scope: !386)
!427 = !DILocation(line: 49, column: 24, scope: !386)
!428 = !DILocation(line: 49, column: 39, scope: !386)
